{
  "places": [
    {
      "id": "0",
      "name": "La Mezquita de Córdoba",
      "smallParagraph": "El monumento más importante de Córdoba es la Mezquita Catedral. Cualquier escapada a Córdoba, por pequeña que sea, tiene que incluir su visita. Fue declarada Patrimonio de la Humanidad por la UNESCO en el año 1984. Se empezó a construir en el año 785 y tiene diferentes estilos arquitectónicos...",
      "allParagraphs": "El monumento más importante de Córdoba es la Mezquita Catedral. Cualquier escapada a Córdoba, por pequeña que sea, tiene que incluir su visita. Fue declarada Patrimonio de la Humanidad por la UNESCO en el año 1984. Se empezó a construir en el año 785 y tiene diferentes estilos arquitectónicos: omeya, gótico, renacentista y barroco. Durante años, fue la mezquita más grande del Mundo después de la Meca (hasta que se construyó la Mezquita Azul de Estambul). Hay muchas curiosidades entorno a la Mezquita de Córdoba, aunque la más importante es que se construyó la Catedral dentro de la Mezquita porque esta era tan bella que no se atrevieron a destruirla. De hecho, para mi es uno de los sitios de España más impresionantes. También se conserva su minarete o alminar. Con más de 1.300 columnas y arcos, cuando entras a la Mezquita de Córdoba es fácil emocionarse. Por muchas fotos que hayas visto, no es comparable con estar allí. Al ser el monumento de Córdoba más visitado, también es el que se forman más colas para entrar. Por eso, te recomiendo que te apuntes a la visita guiada por la Mezquita Catedral ya que entrarás sin hacer cola y un guía experto te explicará su historia, arquitectura y todos los detalles.",
      "rating": [],
      "images": [
        "../assets/images/place0/place0_1.jpeg",
        "../assets/images/place0/place0_2.jpeg",
        "../assets/images/place0/place0_3.webp",
        "../assets/images/place0/place0_4.avif",
        "../assets/images/place0/place0_5.png"
      ]
    },
    {
      "id": "1",
      "name": "El Palacio de Viviana",
      "smallParagraph": "Con 12 patios de estilo andaluz, el Palacio de Viana es uno de los monumentos de Córdoba que te recomiendo visitar. Se trata de una casa-palacio del siglo XIV que se ha ido ampliando con los años para satisfacer las necesidades de sus inquilinos. Los patios es lo que más...",
      "allParagraphs": "Con 12 patios de estilo andaluz, el Palacio de Viana es uno de los monumentos de Córdoba que te recomiendo visitar. Se trata de una casa-palacio del siglo XIV que se ha ido ampliando con los años para satisfacer las necesidades de sus inquilinos. Los patios es lo que más me gustó de la visita al Palacio de Viana. Están bonitos y bien cuidados en cualquier época del año, aunque la primavera es la mejor época para ver las flores en todo su esplendor. Los patios se pueden visitar por libre, pero el interior del Palacio de Viana sólo se puede ver con una visita guiada. Calcula aproximadamente 2h para ver el palacio por dentro y los patios. En el interior del Palacio de Viana te espera un recorrido por las diferentes estancias. Algunas como el Salón Rojo o el Dormitorio negro son de gran belleza. Ya te aviso que desde la puerta de la calle parece un sito austero, pero por dentro es uno de los sitios con más interés histórico de la ciudad.",
      "rating": [
        "5",
        "3"
      ],
      "images": [
        "../assets/images/place1/place1_1.jpg",
        "../assets/images/place1/place1_2.jpg",
        "../assets/images/place1/place1_3.jpg",
        "../assets/images/place1/place1_4.jpg",
        "../assets/images/place1/place1_5.jpg"
      ]
    },
    {
      "id": "2",
      "name": "El Alcázar de los Reyes Cristianos",
      "smallParagraph": "El Alcázar de los Reyes Cristianos fue palacio real durante muchos años. De hecho, tanto romanos, visigodos, árabes y cristianos utilizaron el Alcázar como sede de gobierno. Los residentes más conocidos fueron los Reyes Católicos, que se asentaron en el Alcázar de Córdoba durante años para planear la reconquista de...",
      "allParagraphs": "El Alcázar de los Reyes Cristianos fue palacio real durante muchos años. De hecho, tanto romanos, visigodos, árabes y cristianos utilizaron el Alcázar como sede de gobierno. Los residentes más conocidos fueron los Reyes Católicos, que se asentaron en el Alcázar de Córdoba durante años para planear la reconquista de Granada. Cristóbal Colón fue otro personaje ilustre que pisó el Alcázar para pedir permiso a los Reyes Católicos para su viaje a América. Este es uno de los monumentos históricos de Córdoba que te recomendamos visitar para conocer tanto el interior del Alcázar de los Reyes Cristianos como sus torres y jardines. Si eres de los que te gusta enterarte de todo lo que ves y conocer la historia de sitios, te recomendamos que hagas la visita guiada. En la época del califato, el Alcázar perdió protagonismo con la construcción de la Medina Azahara. El primer califa Abderramán III quiso mover su palacio y la sede política a la Medina Azahara para mostrar su poder.",
      "rating": [],
      "images": [
        "../assets/images/place2/place2_1.avif",
        "../assets/images/place2/place2_2.jpg",
        "../assets/images/place2/place2_3.jpg",
        "../assets/images/place2/place2_4.jpg",
        "../assets/images/place2/place2_5.jpg"
      ]
    },
    {
      "id": "3",
      "name": "La Capilla Mudéjar de San Bartolomé",
      "smallParagraph": "La Capilla Mudéjar de San Bartolomé es uno de los rincones de la Judería de Córdoba con más encanto. Se trata de una capilla pequeña, de unos 9 metros de lado, pero que realmente nos dejó impresionados. Se construyó en el siglo XIV y se conservan en perfecto estado los...",
      "allParagraphs": "La Capilla Mudéjar de San Bartolomé es uno de los rincones de la Judería de Córdoba con más encanto. Se trata de una capilla pequeña, de unos 9 metros de lado, pero que realmente nos dejó impresionados. Se construyó en el siglo XIV y se conservan en perfecto estado los azulejos y las yeserías. Vale la pena entrar para ver los detalles de su decoración, como las inscripciones en las paredes. Si tienes la suerte de poder visitarlo en soledad (como nosotros), te parecerá un lugar íntimo lleno de historia. Quizá sea uno de los lugares menos conocidos de la Judería, pero es un gran exponente de la cultura y del patrimonio que nos ha llegado del Al-Ándalus.",
      "rating": [],
      "images": [
        "../assets/images/place3/place3_1.jpg",
        "../assets/images/place3/place3_2.jpg",
        "../assets/images/place3/place3_3.jpg",
        "../assets/images/place3/place3_4.jpg",
        "../assets/images/place3/place3_5.jpg"
      ]
    },
    {
      "id": "4",
      "name": "La Sinagoga de Córdoba",
      "smallParagraph": "La única sinagoga que puedes ver en Andalucía es esta de Córdoba. Está situada en el barrio de la Judería y fue construida en el año 1314. La entrada es gratuita para miembros de la UE. Es de admirar el buen estado de conservación en el que se encuentra la...",
      "allParagraphs": "La única sinagoga que puedes ver en Andalucía es esta de Córdoba. Está situada en el barrio de la Judería y fue construida en el año 1314. La entrada es gratuita para miembros de la UE. Es de admirar el buen estado de conservación en el que se encuentra la Sinagoga de Córdoba. Las partes más importantes que visitarás serán el patio, la sala de la oración, la zona de las abluciones y la galería de las mujeres. Cuando los judíos fueron expulsados de Córdoba, la sinagoga pasó a ser un hospital, después una ermita y más tarde un parvulario. A partir del 1885 se decide restaurar el monumento para darle el valor de sinagoga que tuvo en el pasado.",
      "rating": [],
      "images": [
        "../assets/images/place4/place4_1.jpg",
        "../assets/images/place4/place4_2.jpg",
        "../assets/images/place4/place4_3.jpg",
        "../assets/images/place4/place4_4.jpg",
        "../assets/images/place4/place4_5.jpg"
      ]
    },
    {
      "id": "5",
      "name": "Torre de Calahorra",
      "smallParagraph": "Otro de los monumentos importantes de Córdoba es la Torre de Calahorra. Está situada en el otro lado del río Guadalquivir al centro de la ciudad. Llegarás a ella cruzando el Puente Romano. La torre se utilizó para defender Córdoba en la antigüedad. En la actualidad, la torre de...",
      "allParagraphs": "Otro de los monumentos importantes de Córdoba es la Torre de Calahorra. Está situada en el otro lado del río Guadalquivir al centro de la ciudad. Llegarás a ella cruzando el Puente Romano. La torre se utilizó para defender Córdoba en la antigüedad. En la actualidad, la torre de Calahorra es un museo que muestra las 3 culturas de la época medieval en España: musulmana, judía y cristiana.",
      "rating": [],
      "images": [
        "../assets/images/place5/place5_1.jpg",
        "../assets/images/place5/place5_2.jpg",
        "../assets/images/place5/place5_3.avif",
        "../assets/images/place5/place5_4.jpg",
        "../assets/images/place5/place5_5.jpg"
      ]
    },
    {
      "id": "6",
      "name": "Las Caballerizas Reales",
      "smallParagraph": "En el 1572, Felipe II mandó construir las Caballerizas Reales de Córdoba para criar los mejores caballos para la casa real. Desde entonces y hasta el 1995, han vivido aquí caballos árabes y cordobeses para uso militar y del servicio de la monarquía. En sus mejores momentos, llegaron...",
      "allParagraphs": "En el 1572, Felipe II mandó construir las Caballerizas Reales de Córdoba para criar los mejores caballos para la casa real. Desde entonces y hasta el 1995, han vivido aquí caballos árabes y cordobeses para uso militar y del servicio de la monarquía. En sus mejores momentos, llegaron a haber más de 100 caballos. Desde hace unos años, el recinto se utiliza para realizar un espectáculo ecuestre “Pasión y Duende del Caballo Andaluz”. Si visitas el Alcázar, podrás ver las caballerizas desde una de sus torres.",
      "rating": [],
      "images": [
        "../assets/images/place6/place6_1.jpg",
        "../assets/images/place6/place6_2.jpg",
        "../assets/images/place6/place6_3.jpg",
        "../assets/images/place6/place6_4.jpg",
        "../assets/images/place6/place6_5.webp"
      ]
    },
    {
      "id": "7",
      "name": "El Museo de Julio Romero",
      "smallParagraph": "El Museo de Julio Romero se encuentra en la Plaza del Potro. El museo es un homenaje a las pinturas más importantes del pintor como La Chiquita Piconera o Naranjas y Limones. Comparte instalaciones con el museo de Bellas Artes de Córdoba. El museo se inauguró en...",
      "allParagraphs": "El Museo de Julio Romero se encuentra en la Plaza del Potro. El museo es un homenaje a las pinturas más importantes del pintor como La Chiquita Piconera o Naranjas y Limones. Comparte instalaciones con el museo de Bellas Artes de Córdoba. El museo se inauguró en 1931, un año después de la muerte del pintor. Durante estos años, se ha ido ampliando la colección con obras y mobiliario que ha ido aportando la familia. Si te gustan los museos de pintura, este es uno de los más importantes de Córdoba.",
      "rating": [],
      "images": [
        "../assets/images/place7/place7_1.jpg",
        "../assets/images/place7/place7_2.webp",
        "../assets/images/place7/place7_3.jpg",
        "../assets/images/place7/place7_4.jpg",
        "../assets/images/place7/place7_5.jpg"
      ]
    },
    {
      "id": "8",
      "name": "La Plaza de la Corredera",
      "smallParagraph": "Otro de los monumentos típicos de Córdoba es la Plaza de la Corredera. Esta es la plaza castellana más grande de planta cuadrangular. Cuando la visites, te encontrarás una plaza animada a cualquier hora del día. Los bares con terrazas son uno de los sitios preferidos por los cordobeses...",
      "allParagraphs": "Otro de los monumentos típicos de Córdoba es la Plaza de la Corredera. Esta es la plaza castellana más grande de planta cuadrangular. Cuando la visites, te encontrarás una plaza animada a cualquier hora del día. Los bares con terrazas son uno de los sitios preferidos por los cordobeses para salir y tomar algo. Además, también se usa para algunos festejos como el Carnaval o la Noche Blanca del Flamenco. Aunque la Plaza de la Corredera tal y como la ves ahora se construyó en el siglo XVII, no te olvides de que ha tenido un pasado desde la época romana. Aquí se han encontrado restos del antiguo circo romano. También, la Inquisición hacía de justiciera en esta plaza y finalmente se usó como plaza de toros.",
      "rating": [],
      "images": [
        "../assets/images/place8/place8_1.jpg",
        "../assets/images/place8/place8_2.jpg",
        "../assets/images/place8/place8_3.jpg",
        "../assets/images/place8/place8_4.jpg",
        "../assets/images/place8/place8_5.jpg"
      ]
    }
  ],
  "users": [
    {
      "id": "bf05",
      "role": "usuario",
      "firstName": "jj",
      "lastName": "jj",
      "birthdayDate": "2024-03-01",
      "email": "jj@gmail.com",
      "phoneNumber": "890876542",
      "gender": "3",
      "comunity": "Cádiz",
      "password": "EsteEsElToken"
    },
    {
      "id": "0b66",
      "role": "admin",
      "firstName": "José Carlos",
      "lastName": "Pérez",
      "birthdayDate": "2024-03-05",
      "email": "joseca@gmail.com",
      "phoneNumber": "640999999",
      "gender": "2",
      "comunity": "Andalucía",
      "password": "1234",
      "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjBiNjYiLCJyb2xlIjoiYWRtaW4iLCJmaXJzdE5hbWUiOiJKb3PDqSBDYXJsb3MiLCJsYXN0TmFtZSI6IlDDqXJleiIsImJpcnRoZGF5RGF0ZSI6IjIwMjQtMDMtMDVUMjM6MDA6MDAuMDAwWiIsImVtYWlsIjoiam9zZWNhQGdtYWlsLmNvbSIsInBob25lTnVtYmVyIjoiNjQwOTk5OTk5IiwicGFzc3dvcmQiOiIxMjM0In0.hXSH3RUYA075J9PM66uuwixer1896_oYJbD_QsoqAtc"
    },
    {
      "id": "0b67",
      "role": "usuario",
      "firstName": "usuario",
      "lastName": "uno",
      "birthdayDate": "2024-03-05",
      "email": "user@gmail.com",
      "phoneNumber": "640999999",
      "gender": "2",
      "comunity": "Andalucía",
      "password": "1234",
      "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjBiNjciLCJyb2xlIjoidXN1YXJpbyIsImZpcnN0TmFtZSI6InVzdWFyaW8iLCJsYXN0TmFtZSI6InVubyIsImJpcnRoZGF5RGF0ZSI6IjIwMjQtMDMtMDVUMjM6MDA6MDAuMDAwWiIsImVtYWlsIjoidXNlckBnbWFpbC5jb20iLCJwaG9uZU51bWJlciI6IjY0MDk5OTk5OSIsInBhc3N3b3JkIjoiMTIzNCJ9.7YbXDjh9Lcp_ipCcQxiyRDqR0Rb3nQn_jl5dSSj2Z4k"
    },
    {
      "id": "a1ba",
      "role": "usuario",
      "firstName": "Daniel",
      "lastName": "Hermosin",
      "birthdayDate": "2002-05-24",
      "email": "daniel@gmail.com",
      "phoneNumber": "680989898",
      "gender": "2",
      "comunity": "Andalucía",
      "password": "pestillo",
      "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6ImExYmEiLCJyb2xlIjoidXN1YXJpbyIsImZpcnN0TmFtZSI6IkRhbmllbCIsImxhc3ROYW1lIjoiSGVybW9zaW4iLCJiaXJ0aGRheURhdGUiOiIyMDAyLTA1LTI0IiwiZW1haWwiOiJkYW5pZWxAZ21haWwuY29tIiwicGFzc3dvcmQiOiJwZXN0aWxsbyJ9.rBvxP3L_13eqOXFSMpvI_HArWAQlzyPOjxMyjKy3dtg"
    },
    {
      "id": "6674",
      "role": "usuario",
      "firstName": "jose",
      "lastName": "perez",
      "birthdayDate": null,
      "email": "joseca2@gmail.com",
      "phoneNumber": "123",
      "gender": null,
      "comunity": null,
      "password": "1234",
      "token": "CambiarPorTokenCorrespondiente"
    }
  ],
  "ratings": [
    {
      "id": "0",
      "idUser": "0b67",
      "idPlace": "1",
      "rating": "5",
      "comment": "ahora si ma gustao"
    },
    {
      "id": "bfdb",
      "idUser": "a1ba",
      "idPlace": "1",
      "rating": "3",
      "comment": "hola"
    }
  ]
}